#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```tf

terraform
Acquiring state lock. This may take a few moments...
module.network.google_compute_address.hotwg_asne3_prod_1: Refreshing state... [id=projects/storied-channel-359115/regions/asia-northeast3/addresses/hotwg-asne3-prod-1]
module.storage.google_storage_bucket.hotwg_asne3_tfstate_prod_1: Refreshing state... [id=hotwg-asne3-tfstate-prod-1]
module.iam.google_service_account.gce: Refreshing state... [id=projects/storied-channel-359115/serviceAccounts/google-compute-engine@storied-channel-359115.iam.gserviceaccount.com]
module.network.google_compute_network.hotwg_prod_1: Refreshing state... [id=projects/storied-channel-359115/global/networks/hotwg-prod-1]
module.network.google_compute_subnetwork.hotwg_asne3_prod_1: Refreshing state... [id=projects/storied-channel-359115/regions/asia-northeast3/subnetworks/hotwg-asne3-prod-1]
module.network.google_compute_firewall.hotwg_prod_1_allow_http: Refreshing state... [id=projects/storied-channel-359115/global/firewalls/hotwg-prod-1-allow-http]
module.network.google_compute_firewall.hotwg_prod_1_allow_ssh: Refreshing state... [id=projects/storied-channel-359115/global/firewalls/hotwg-prod-1-allow-ssh]
module.compute.google_compute_instance.hotwg_asne3_prod_1: Refreshing state... [id=projects/storied-channel-359115/zones/asia-northeast3-c/instances/hotwg-asne3-prod-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.google_compute_instance.hotwg_asne3_prod_2 will be created
  + resource "google_compute_instance" "hotwg_asne3_prod_2" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = {
          + "ssh-keys" = "default:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwdCxPcVEslNkuIA508cd8xRucUIIdKy8PNdHzoFLOzt1HXUtDD6y/pVmqEut4P6DMPPt7WNI8JkqBL7a9FlFIHmLK5hR7aHVKJt7bL/bHacdIH3MagjfwRBmHGY2kTEP+/WSVW6bhqyI5P5dFy22RZt7POqvvzCYnp5rzzl8JBDOjjtLmQz1XwK0Hoa5ue3W1GX8N+TxUo5/psNM4WhHHPZRkRr/lSZqhO4QfwjGK3K88YVyR0kZWWCDsEW/zRZrJgU9/q8oU161Fu/vTZBDw9FoYRfCQ1FfjAw1Wpp1ftXI3hkAyGFf9Ezvfuv5teVO0JnAs5HQ7h8BFw92J45AUSAXcG/yoezqMj/vW3FP08geQhLCZaohc70A5PNkBv90ByACebsOaQ6dbrcdzlZr2KMe2noT9zyr0KMcDmrB7wyUf8jqdRJE7HY4epK+VNwqeZnpvj3n+fHURD2k+Bs8Cpoa6FYfXYW1iRCb+Xe7V7eqHBHTvtGz9o2SfY2a/cC8= user@AL02261967.local"
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "hotwg-asne3-prod-2"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "allow-http",
          + "allow-ssh",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-northeast3-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-11"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "projects/storied-channel-359115/regions/asia-northeast3/subnetworks/hotwg-asne3-prod-1"
          + subnetwork_project = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = "google-compute-engine@storied-channel-359115.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @heumsi, Action: `pull_request`, Workflow: `.github/workflows/terraform-pr.yaml`*